7767517
142 160
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 512 0=64 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=1 6=9408
ReLU             Relu_1                   1 1 512 329
Pooling          MaxPool_2                1 1 329 330 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 330 330_splitncnn_0 330_splitncnn_1
Convolution      Conv_3                   1 1 330_splitncnn_1 515 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_4                   1 1 515 333
Convolution      Conv_5                   1 1 333 518 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_6                   1 1 518 336
Convolution      Conv_7                   1 1 336 521 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Convolution      Conv_8                   1 1 330_splitncnn_0 524 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
BinaryOp         Add_9                    2 1 521 524 341 0=0
ReLU             Relu_10                  1 1 341 342
Split            splitncnn_1              1 2 342 342_splitncnn_0 342_splitncnn_1
Convolution      Conv_11                  1 1 342_splitncnn_1 527 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_12                  1 1 527 345
Convolution      Conv_13                  1 1 345 530 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_14                  1 1 530 348
Convolution      Conv_15                  1 1 348 533 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
BinaryOp         Add_16                   2 1 533 342_splitncnn_0 351 0=0
ReLU             Relu_17                  1 1 351 352
Split            splitncnn_2              1 2 352 352_splitncnn_0 352_splitncnn_1
Convolution      Conv_18                  1 1 352_splitncnn_1 536 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_19                  1 1 536 355
Convolution      Conv_20                  1 1 355 539 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_21                  1 1 539 358
Convolution      Conv_22                  1 1 358 542 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
BinaryOp         Add_23                   2 1 542 352_splitncnn_0 361 0=0
ReLU             Relu_24                  1 1 361 362
Split            splitncnn_3              1 2 362 362_splitncnn_0 362_splitncnn_1
Convolution      Conv_25                  1 1 362_splitncnn_1 545 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             Relu_26                  1 1 545 365
Convolution      Conv_27                  1 1 365 548 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_28                  1 1 548 368
Convolution      Conv_29                  1 1 368 551 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Convolution      Conv_30                  1 1 362_splitncnn_0 554 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=131072
BinaryOp         Add_31                   2 1 551 554 373 0=0
ReLU             Relu_32                  1 1 373 374
Split            splitncnn_4              1 2 374 374_splitncnn_0 374_splitncnn_1
Convolution      Conv_33                  1 1 374_splitncnn_1 557 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_34                  1 1 557 377
Convolution      Conv_35                  1 1 377 560 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_36                  1 1 560 380
Convolution      Conv_37                  1 1 380 563 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         Add_38                   2 1 563 374_splitncnn_0 383 0=0
ReLU             Relu_39                  1 1 383 384
Split            splitncnn_5              1 2 384 384_splitncnn_0 384_splitncnn_1
Convolution      Conv_40                  1 1 384_splitncnn_1 566 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_41                  1 1 566 387
Convolution      Conv_42                  1 1 387 569 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_43                  1 1 569 390
Convolution      Conv_44                  1 1 390 572 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         Add_45                   2 1 572 384_splitncnn_0 393 0=0
ReLU             Relu_46                  1 1 393 394
Split            splitncnn_6              1 2 394 394_splitncnn_0 394_splitncnn_1
Convolution      Conv_47                  1 1 394_splitncnn_1 575 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_48                  1 1 575 397
Convolution      Conv_49                  1 1 397 578 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_50                  1 1 578 400
Convolution      Conv_51                  1 1 400 581 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
BinaryOp         Add_52                   2 1 581 394_splitncnn_0 403 0=0
ReLU             Relu_53                  1 1 403 404
Split            splitncnn_7              1 2 404 404_splitncnn_0 404_splitncnn_1
Convolution      Conv_54                  1 1 404_splitncnn_1 584 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ReLU             Relu_55                  1 1 584 407
Convolution      Conv_56                  1 1 407 587 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_57                  1 1 587 410
Convolution      Conv_58                  1 1 410 590 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Convolution      Conv_59                  1 1 404_splitncnn_0 593 0=1024 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=524288
BinaryOp         Add_60                   2 1 590 593 415 0=0
ReLU             Relu_61                  1 1 415 416
Split            splitncnn_8              1 2 416 416_splitncnn_0 416_splitncnn_1
Convolution      Conv_62                  1 1 416_splitncnn_1 596 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_63                  1 1 596 419
Convolution      Conv_64                  1 1 419 599 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_65                  1 1 599 422
Convolution      Conv_66                  1 1 422 602 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
BinaryOp         Add_67                   2 1 602 416_splitncnn_0 425 0=0
ReLU             Relu_68                  1 1 425 426
Split            splitncnn_9              1 2 426 426_splitncnn_0 426_splitncnn_1
Convolution      Conv_69                  1 1 426_splitncnn_1 605 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_70                  1 1 605 429
Convolution      Conv_71                  1 1 429 608 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_72                  1 1 608 432
Convolution      Conv_73                  1 1 432 611 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
BinaryOp         Add_74                   2 1 611 426_splitncnn_0 435 0=0
ReLU             Relu_75                  1 1 435 436
Split            splitncnn_10             1 2 436 436_splitncnn_0 436_splitncnn_1
Convolution      Conv_76                  1 1 436_splitncnn_1 614 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_77                  1 1 614 439
Convolution      Conv_78                  1 1 439 617 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_79                  1 1 617 442
Convolution      Conv_80                  1 1 442 620 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
BinaryOp         Add_81                   2 1 620 436_splitncnn_0 445 0=0
ReLU             Relu_82                  1 1 445 446
Split            splitncnn_11             1 2 446 446_splitncnn_0 446_splitncnn_1
Convolution      Conv_83                  1 1 446_splitncnn_1 623 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_84                  1 1 623 449
Convolution      Conv_85                  1 1 449 626 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_86                  1 1 626 452
Convolution      Conv_87                  1 1 452 629 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
BinaryOp         Add_88                   2 1 629 446_splitncnn_0 455 0=0
ReLU             Relu_89                  1 1 455 456
Split            splitncnn_12             1 2 456 456_splitncnn_0 456_splitncnn_1
Convolution      Conv_90                  1 1 456_splitncnn_1 632 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_91                  1 1 632 459
Convolution      Conv_92                  1 1 459 635 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_93                  1 1 635 462
Convolution      Conv_94                  1 1 462 638 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
BinaryOp         Add_95                   2 1 638 456_splitncnn_0 465 0=0
ReLU             Relu_96                  1 1 465 466
Split            splitncnn_13             1 2 466 466_splitncnn_0 466_splitncnn_1
Convolution      Conv_97                  1 1 466_splitncnn_1 641 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=524288
ReLU             Relu_98                  1 1 641 469
Convolution      Conv_99                  1 1 469 644 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             Relu_100                 1 1 644 472
Convolution      Conv_101                 1 1 472 647 0=2048 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
Convolution      Conv_102                 1 1 466_splitncnn_0 650 0=2048 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=2097152
BinaryOp         Add_103                  2 1 647 650 477 0=0
ReLU             Relu_104                 1 1 477 478
Split            splitncnn_14             1 2 478 478_splitncnn_0 478_splitncnn_1
Convolution      Conv_105                 1 1 478_splitncnn_1 653 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
ReLU             Relu_106                 1 1 653 481
Convolution      Conv_107                 1 1 481 656 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             Relu_108                 1 1 656 484
Convolution      Conv_109                 1 1 484 659 0=2048 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
BinaryOp         Add_110                  2 1 659 478_splitncnn_0 487 0=0
ReLU             Relu_111                 1 1 487 488
Split            splitncnn_15             1 2 488 488_splitncnn_0 488_splitncnn_1
Convolution      Conv_112                 1 1 488_splitncnn_1 662 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
ReLU             Relu_113                 1 1 662 491
Convolution      Conv_114                 1 1 491 665 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             Relu_115                 1 1 665 494
Convolution      Conv_116                 1 1 494 668 0=2048 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
BinaryOp         Add_117                  2 1 668 488_splitncnn_0 497 0=0
ReLU             Relu_118                 1 1 497 498
Pooling          AveragePool_120          1 1 498 500 0=1 1=7 11=7 2=7 12=7 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          Reshape_126              1 1 500 508 0=-1
Split            splitncnn_16             1 3 508 508_splitncnn_0 508_splitncnn_1 508_splitncnn_2
InnerProduct     Gemm_127                 1 1 508_splitncnn_2 509 0=66 1=1 2=135168
InnerProduct     Gemm_128                 1 1 508_splitncnn_1 510 0=66 1=1 2=135168
InnerProduct     Gemm_129                 1 1 508_splitncnn_0 511 0=66 1=1 2=135168
